ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_i2c.c
/*!

    Copyright (c) 2020, ZK Inc.

    All rights reserved.
*/

#include "bsp_i2c.h"
#include "project_select.h"
#include <string.h>
#include "main.h"
#include "OSPort.h"
#include "Message.h"
#include "MsgHndlr.h"
#include "IPMDevice.h"


static void i2c0_int(void);
static void i2c1_int(void);

static void i2c0_config(void);
static void i2c0_nvic_config(void);
static void i2c0_gpio_config(void);
static void i2c0_rcu_config(void);

static void i2c1_config(void);
static void i2c1_nvic_config(void);
static void i2c1_gpio_config(void);
static void i2c1_rcu_config(void);
#ifdef I2C2
static void i2c2_int(void);
static void i2c2_config(void);
static void i2c2_nvic_config(void);
static void i2c2_gpio_config(void);
static void i2c2_rcu_config(void);    
#endif

static bool i2c_bytes_write(uint32_t i2cx, uint8_t device_addr, const uint8_t *p_buffer, uint16_t len, int time_out);
static bool i2c_bytes_read(uint32_t i2cx, uint8_t device_addr, uint8_t read_addr, uint8_t *p_buffer, uint16_t len, int time_out);
static void i2c_set_as_slave_device_addr(uint32_t i2c_periph, uint8_t device_addr);

void i2c_int(void)
{
    i2c_channel_init(I2C0);
    i2c_channel_init(I2C1);
#ifdef I2C2
    i2c_channel_init(I2C2); 
#endif
}

void i2c_channel_init(uint32_t i2cx)
{
    switch(i2cx)
    {
    case I2C0:
        i2c0_int();
        break;
    case I2C1:
        i2c1_int();
        break;
#ifdef I2C2
    case I2C2:
        i2c2_int();
        LOG_I("i2c2_int");
        break;
#endif
    default:
        break;
    }
}

static void i2c0_int(void)
{
    i2c0_rcu_config();
    i2c0_gpio_config();
    i2c0_nvic_config();
    i2c0_config();
}

static void i2c1_int(void)
{
    i2c1_rcu_config();
    i2c1_gpio_config();
    i2c1_nvic_config();
    i2c1_config();
}

static void i2c0_rcu_config(void)
{
    /* enable I2C0 clock */
    rcu_periph_clock_enable(RCU_I2C0);

    /* enable GPIO clock */
    rcu_periph_clock_enable(I2C0_SCL_GPIO_CLK);
    rcu_periph_clock_enable(I2C0_SDA_GPIO_CLK);
}

static void i2c1_rcu_config(void)
{
    /* enable I2C1 clock */
    rcu_periph_clock_enable(RCU_I2C1);

    /* enable GPIO clock */
    rcu_periph_clock_enable(I2C1_SCL_GPIO_CLK);
    rcu_periph_clock_enable(I2C1_SDA_GPIO_CLK);
}


/*!
    \brief      cofigure the GPIO ports.
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c0_gpio_config(void)
{
    /* I2C0 and I2C1 GPIO ports */
    /* connect I2C0_SCL I2C0_SDA*/
    gpio_init(I2C0_SCL_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C0_SCL_PIN);
    gpio_init(I2C0_SDA_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C0_SDA_PIN);
#ifdef I2C0_REMAP
    gpio_pin_remap_config(GPIO_I2C0_REMAP, ENABLE);
#endif
}

/*!
    \brief      cofigure the GPIO ports.
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c1_gpio_config(void)
{
    /* connect I2C1_SCL I2C1_SDA*/
    gpio_init(I2C1_SCL_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C1_SCL_PIN);
    gpio_init(I2C1_SDA_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C1_SDA_PIN);
#ifdef I2C1_REMAP
	#ifdef GD32F2x
    gpio_pin_remap1_config(GPIO_PCF5, GPIO_PCF5_I2C1_REMAP1, ENABLE);
	#endif
#endif
}


/*!
    \brief      cofigure the I2C0 and I2C1 interfaces..
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c0_config(void)
{
    // **************************** I2C0 *********************************************
    /* I2C clock configure */
    i2c_clock_config(I2C0, 100000, I2C_DTCY_2);
    /* I2C address configure */
    i2c_mode_addr_config(I2C0, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, I2C0_SLAVE_ADDRESS7);
    /* enable I2C0 */
    i2c_enable(I2C0);
    /* enable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_ENABLE);

    /* enable the I2C0 interrupt */
    i2c_interrupt_enable(I2C0, I2C_INT_ERR);
    i2c_interrupt_enable(I2C0, I2C_INT_EV);
    i2c_interrupt_enable(I2C0, I2C_INT_BUF);
}

/*!
    \brief      cofigure the I2C0 and I2C1 interfaces..
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c1_config(void)
{
    // **************************** I2C1 *********************************************
    i2c_clock_config(I2C1, 100000, I2C_DTCY_2);
    /* I2C address configure */
    i2c_mode_addr_config(I2C1, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, I2C1_SLAVE_ADDRESS7);
    /* enable I2C1 */
    i2c_enable(I2C1);
    /* enable acknowledge */
    i2c_ack_config(I2C1, I2C_ACK_ENABLE);

    /* enable the I2C0 interrupt */
    i2c_interrupt_enable(I2C1, I2C_INT_ERR);
    i2c_interrupt_enable(I2C1, I2C_INT_EV);
    i2c_interrupt_enable(I2C1, I2C_INT_BUF);
}


/*!
    \brief      cofigure the NVIC peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c0_nvic_config(void)
{
    nvic_irq_enable(I2C0_EV_IRQn, 3, 0);
    nvic_irq_enable(I2C0_ER_IRQn, 8, 0);
}

/*!
    \brief      cofigure the NVIC peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c1_nvic_config(void)
{
    nvic_irq_enable(I2C1_EV_IRQn, 3, 0);
    nvic_irq_enable(I2C1_ER_IRQn, 8, 0);
}


/**
  * @brief   
  * @param   
  *	@arg p_buffer: 
  *	@arg 
  * @arg len:
  * @retval  ?
  */
static bool i2c_bytes_write(uint32_t i2cx, uint8_t device_addr, const uint8_t *p_buffer, uint16_t len, int time_out)
{
    int i = 0;
    int timeout = time_out;
    int err_code = 0;

    /* disable I2C0 interrupt */
    i2c_interrupt_disable(i2cx, I2C_INT_BUF);
    i2c_interrupt_disable(i2cx, I2C_INT_EV);

    taskENTER_CRITICAL();
    /* wait until I2C bus is idle */
    while (i2c_flag_get(i2cx, I2C_FLAG_I2CBSY))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 1;
            goto __exit;  
        }
    }

    timeout = time_out;
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2cx);
    /* wait until SBSEND bit is set */
    while (!i2c_flag_get(i2cx, I2C_FLAG_SBSEND))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 2;
            goto __exit; 
        }
    }

    timeout = time_out;
    /* send slave address to I2C bus */
    i2c_master_addressing(i2cx, device_addr, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while (!i2c_flag_get(i2cx, I2C_FLAG_ADDSEND))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 3;
            goto __exit; 
        }
    }
    /* clear ADDSEND bit */
    i2c_flag_clear(i2cx, I2C_FLAG_ADDSEND);
    timeout = time_out;
    /* wait until the transmit data buffer is empty */
    while (!i2c_flag_get(i2cx, I2C_FLAG_TBE))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 4;
            goto __exit; 
        }
    }

    for (i = 0; i < len; i++)
    {
        timeout = time_out;
        /* data transmission */
        i2c_data_transmit(i2cx, p_buffer[i]);
        /* wait until the TBE bit is set */
        while (!i2c_flag_get(i2cx, I2C_FLAG_TBE))
        {
            timeout--;
            if (timeout == 0)
            {
                err_code = 5;
                goto __exit; 
            }
        }
    }
    /* send a stop condition to I2C bus */
    timeout = time_out;
    i2c_stop_on_bus(i2cx);
    while (I2C_CTL0(i2cx) & 0x0200)
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 6;
            goto __exit;  
        }
    }

    /* enable I2C0 interrupt */
    i2c_interrupt_enable(i2cx, I2C_INT_BUF);
    i2c_interrupt_enable(i2cx, I2C_INT_EV);

