ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_i2c.c
    taskEXIT_CRITICAL();

    return true;

__exit:
    i2c_deinit(i2cx);
    i2c_channel_init(i2cx);
    taskEXIT_CRITICAL();
    //LOG_E("I2C write err code: %d.", err_code);
    return false;
}

/**
  * @brief   
  * @param   
  *	@arg p_buffer: 
  *	@arg 
  * @arg len:
  * @retval  ?
  */
static bool i2c_bytes_read(uint32_t i2cx, uint8_t device_addr, uint8_t read_addr, uint8_t *p_buffer, uint16_t len, int time_out)
{ 
    int timeout = time_out; 
    int err_code = 0;

    /* wait until I2C bus is idle */
    while (i2c_flag_get(i2cx, I2C_FLAG_I2CBSY))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 1;
            goto __exit;
        }
    }

    if(2 == len){
        i2c_ackpos_config(i2cx,I2C_ACKPOS_NEXT);
    }
    
    timeout = time_out;
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2cx);
    /* wait until SBSEND bit is set */
    while (!i2c_flag_get(i2cx, I2C_FLAG_SBSEND))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 2;
            goto __exit;
        }
    }
    
    timeout = time_out;
    /* send slave address to I2C bus */
    i2c_master_addressing(i2cx, device_addr, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while (!i2c_flag_get(i2cx, I2C_FLAG_ADDSEND))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 3;
            goto __exit;
        }
    }
    
    /* clear ADDSEND bit */
    i2c_flag_clear(i2cx, I2C_FLAG_ADDSEND);
    timeout = time_out;
    /* wait until the transmit data buffer is empty */
    while (!i2c_flag_get(i2cx, I2C_FLAG_TBE))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 4;
            goto __exit;
        }
    }

    /* enable I2C0*/
    i2c_enable(i2cx);

    timeout = time_out;
    /* send the internal address to write to */
    i2c_data_transmit(i2cx, read_addr);
    /* wait until the BTC bit is set */
    while (!i2c_flag_get(i2cx, I2C_FLAG_BTC))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 5;
            goto __exit;
        }
    }

    timeout = time_out;
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2cx);
    /* wait until SBSEND bit is set */
    while (!i2c_flag_get(i2cx, I2C_FLAG_SBSEND))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 6;
            goto __exit;
        }
    }
    
    /* send slave address to I2C bus */
    i2c_master_addressing(i2cx, device_addr, I2C_RECEIVER);

    if(len < 3){
        /* disable acknowledge */
        i2c_ack_config(i2cx,I2C_ACK_DISABLE);
    }
    
    timeout = time_out;
    /* wait until ADDSEND bit is set */
    while (!i2c_flag_get(i2cx, I2C_FLAG_ADDSEND))
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 7;
            goto __exit;
        }
    }
    /* clear the ADDSEND bit */
    i2c_flag_clear(i2cx,I2C_FLAG_ADDSEND);
    
    if(1 == len){
        /* send a stop condition to I2C bus */
        i2c_stop_on_bus(i2cx);
    }
    
    /* while there is data to be read */
    while(len){
        if(3 == len){
            timeout = time_out;
            /* wait until the BTC bit is set */
            while (!i2c_flag_get(i2cx, I2C_FLAG_BTC))
            {
                timeout--;
                if (timeout == 0)
                {
                    err_code = 8;
                    goto __exit;
                }
            }
            /* disable acknowledge */
            i2c_ack_config(i2cx,I2C_ACK_DISABLE);
        }
        else if(2 == len){
            timeout = time_out;
            /* wait until the BTC bit is set */
            while (!i2c_flag_get(i2cx, I2C_FLAG_BTC))
            {
                timeout--;
                if (timeout == 0)
                {
                    err_code = 9;
                    goto __exit;
                }
            }
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus(i2cx);
        }
        
        /* wait until the RBNE bit is set and clear it */
        if(i2c_flag_get(i2cx, I2C_FLAG_RBNE)){
            /* read a byte from the EEPROM */
            *p_buffer = i2c_data_receive(i2cx);
            /* point to the next location where the byte read will be saved */
            p_buffer++; 
            /* decrement the read bytes counter */
            len--;
        } 
    }
    
    timeout = time_out;
    /* wait until the stop condition is finished */
    while (I2C_CTL0(i2cx) & 0x0200)
    {
        timeout--;
        if (timeout == 0)
        {
            err_code = 10;
            goto __exit;
        }
    }
    /* enable acknowledge */
    i2c_ack_config(i2cx,I2C_ACK_ENABLE);
    i2c_ackpos_config(i2cx,I2C_ACKPOS_CURRENT);
		
    return true;

__exit:
    i2c_deinit(i2cx);
    i2c_channel_init(i2cx);
    LOG_E("I2C write & read err code: %d.", err_code);
    return false;
}


bool i2c0_bytes_write(const uint8_t *p_buffer, uint16_t len)
{
    return i2c_bytes_write(I2C0, p_buffer[0], &p_buffer[1], len-1, 20000);
}

bool i2c1_bytes_write(const uint8_t *p_buffer, uint16_t len)
{
    return i2c_bytes_write(I2C1, p_buffer[0], &p_buffer[1], len-1, 20000);
}

bool i2c0_bytes_read(const uint8_t device_addr, const uint8_t read_addr, uint8_t* p_buffer, uint16_t len)
{
    return i2c_bytes_read(I2C0, device_addr, read_addr, p_buffer, len, 1000);
}

bool i2c1_bytes_read(const uint8_t device_addr, const uint8_t read_addr, uint8_t* p_buffer, uint16_t len)
{
    return i2c_bytes_read(I2C1, device_addr, read_addr, p_buffer, len, 10000);
}

static uint8_t g_i2c0_buff_rx[100];
static int g_i2c0_rx_count = 0;
static bool g_i2c0_recv_is_updated = false;
extern TaskHandle_t ComTask_Handler;

/*!
    \brief      handle I2C0 event interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C0_EV_IRQHandler(void)
{
#ifdef USE_I2C0_AS_IPMB
    BaseType_t err;
    static BaseType_t xHigherPriorityTaskWoken;

    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_ADDSEND);
        g_i2c0_rx_count = 0; // start, clear recv count
        g_i2c0_buff_rx[g_i2c0_rx_count++] = GetDevAddr();
    }
    else if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C0);
        g_i2c0_buff_rx[g_i2c0_rx_count++] = i2c_data_receive(I2C0);
    }
    else if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_STPDET))
    {
        // status = SUCCESS;
        g_i2c0_recv_is_updated = true;
        /* clear the STPDET bit */
        i2c_enable(I2C0);
        err = xTaskNotifyFromISR((TaskHandle_t)ComTask_Handler,
                                 (uint32_t)MSG_SRC_I2C,
                                 (eNotifyAction)eSetValueWithoutOverwrite,
                                 (BaseType_t *)xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        if (err == pdFAIL)
        {
            printf("iic send failed!\r\n");
        }
    }

#else
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_ADDSEND);
    }
    else if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C0);
    }
    else if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        i2c_enable(I2C0);
    }

#endif
}

/*!
    \brief      handle I2C0 error interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C0_ER_IRQHandler(void)
{
    /* no acknowledge received */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_AERR))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_AERR);
    }

