ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_i2c.c
    /* SMBus alert */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_SMBALT))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_SMBALT);
    }

    /* bus timeout in SMBus mode */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_SMBTO))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_SMBTO);
    }

    /* over-run or under-run when SCL stretch is disabled */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_OUERR))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_OUERR);
    }

    /* arbitration lost */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_LOSTARB))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_LOSTARB);
    }

    /* bus error */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_BERR))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_BERR);
    }

    /* CRC value doesn't match */
    if (i2c_interrupt_flag_get(I2C0, I2C_INT_FLAG_PECERR))
    {
        i2c_interrupt_flag_clear(I2C0, I2C_INT_FLAG_PECERR);
    }

    /* disable the error interrupt */
    // i2c_interrupt_disable(I2C0, I2C_INT_ERR);
    // i2c_interrupt_disable(I2C0, I2C_INT_BUF);
    // i2c_interrupt_disable(I2C0, I2C_INT_EV);

    i2c_deinit(I2C0);
    i2c_channel_init(I2C0);
}

static uint8_t g_i2c1_buff_rx[80];
static int g_i2c1_rx_count = 0;
static bool g_i2c1_recv_is_updated = false;
/*!
    \brief      handle I2C1 event interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C1_EV_IRQHandler(void)
{
#ifdef USE_I2C1_AS_IPMB
    BaseType_t err;
    static BaseType_t xHigherPriorityTaskWoken;

    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_ADDSEND);
        g_i2c1_rx_count = 0; // start, clear recv count
        g_i2c1_buff_rx[g_i2c1_rx_count++] = GetDevAddr();
    }
    else if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C0);
        g_i2c1_buff_rx[g_i2c1_rx_count++] = i2c_data_receive(I2C1);
    }
    else if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_STPDET))
    {
        // status = SUCCESS;
        g_i2c1_recv_is_updated = true;
        /* clear the STPDET bit */
        i2c_enable(I2C1);
        err = xTaskNotifyFromISR((TaskHandle_t)ComTask_Handler,
                                 (uint32_t)MSG_SRC_I2C,
                                 (eNotifyAction)eSetValueWithoutOverwrite,
                                 (BaseType_t *)xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        if (err == pdFAIL)
        {
            printf("iic send failed!\r\n");
        }
    }

#else
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_ADDSEND);
    }
    else if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C1);
    }
    else if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        i2c_enable(I2C1);
    }

#endif
}

/*!
    \brief      handle I2C1 error interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C1_ER_IRQHandler(void)
{
    /* no acknowledge received */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_AERR))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_AERR);
    }

    /* SMBus alert */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_SMBALT))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_SMBALT);
    }

    /* bus timeout in SMBus mode */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_SMBTO))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_SMBTO);
    }

    /* over-run or under-run when SCL stretch is disabled */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_OUERR))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_OUERR);
    }

    /* arbitration lost */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_LOSTARB))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_LOSTARB);
    }

    /* bus error */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_BERR))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_BERR);
    }

    /* CRC value doesn't match */
    if (i2c_interrupt_flag_get(I2C1, I2C_INT_FLAG_PECERR))
    {
        i2c_interrupt_flag_clear(I2C1, I2C_INT_FLAG_PECERR);
    }

    /* disable the error interrupt */
    // i2c_interrupt_disable(I2C1, I2C_INT_ERR);
    // i2c_interrupt_disable(I2C1, I2C_INT_BUF);
    // i2c_interrupt_disable(I2C1, I2C_INT_EV);

    i2c_deinit(I2C1);
    i2c_channel_init(I2C1);
}

bool i2c0_get_slave_device_data(uint8_t *p_buffer, uint32_t *len)
{
    if (!g_i2c0_recv_is_updated)
    {
        return false;
    }
    memcpy(p_buffer, g_i2c0_buff_rx, g_i2c0_rx_count);
    *len = g_i2c0_rx_count;
    g_i2c0_recv_is_updated = false; // has read

    return true;
}

bool i2c1_get_slave_device_data(uint8_t *p_buffer, uint32_t *len)
{
    if (!g_i2c1_recv_is_updated)
    {
        return false;
    }
    memcpy(p_buffer, g_i2c1_buff_rx, g_i2c1_rx_count);
    *len = g_i2c1_rx_count;
    g_i2c1_recv_is_updated = false; // has read

    return true;
}

#ifdef I2C2
static uint8_t g_i2c2_buff_rx[80];
static int g_i2c2_rx_count = 0;
static bool g_i2c2_recv_is_updated = false;
 
static void i2c2_int(void)
{
    i2c2_rcu_config();
    i2c2_gpio_config();
    i2c2_nvic_config();
    i2c2_config();
}

static void i2c2_rcu_config(void)
{
    /* enable I2C2 clock */
    rcu_periph_clock_enable(RCU_I2C2);

    /* enable GPIO clock */
    rcu_periph_clock_enable(I2C2_SCL_GPIO_CLK);
    rcu_periph_clock_enable(I2C2_SDA_GPIO_CLK);
}
/*!
    \brief      cofigure the GPIO ports.
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c2_gpio_config(void)
{
    /* connect I2C2_SCL I2C2_SDA*/
    gpio_init(I2C2_SCL_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C2_SCL_PIN);
    gpio_init(I2C2_SDA_GPIO_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, I2C2_SDA_PIN);
#ifdef I2C2_REMAP
    gpio_pin_remap1_config(GPIO_PCF5, GPIO_PCF5_I2C2_REMAP0, ENABLE);
#endif
}
bool i2c2_bytes_write(const uint8_t *p_buffer, uint16_t len)
{
    return i2c_bytes_write(I2C2, p_buffer[0], &p_buffer[1], len-1, 20000);
}

/*!
    \brief      cofigure the I2C0 and I2C1 interfaces..
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c2_config(void)
{
    // **************************** I2C2 *********************************************
    i2c_clock_config(I2C2, 100000, I2C_DTCY_2);
    /* I2C address configure */
    i2c_mode_addr_config(I2C2, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, I2C2_SLAVE_ADDRESS7);
    /* enable I2C1 */
    i2c_enable(I2C2);
    /* enable acknowledge */
    i2c_ack_config(I2C2, I2C_ACK_ENABLE);
        /* enable the I2C0 interrupt */
    i2c_interrupt_enable(I2C2, I2C_INT_ERR);
    i2c_interrupt_enable(I2C2, I2C_INT_EV);
    i2c_interrupt_enable(I2C2, I2C_INT_BUF);
}

bool i2c2_get_slave_device_data(uint8_t *p_buffer, uint32_t *len)
{
    if (!g_i2c2_recv_is_updated)
    {
        return false;
    }
    memcpy(p_buffer, g_i2c2_buff_rx, g_i2c2_rx_count);
    *len = g_i2c2_rx_count;
    g_i2c2_recv_is_updated = false; // has read

