ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_i2c.c
    return true;
}

bool i2c2_bytes_read(const uint8_t device_addr, const uint8_t read_addr, uint8_t* p_buffer, uint16_t len)
{
    return i2c_bytes_read(I2C2, device_addr, read_addr, p_buffer, len, 10000);
}

/*!
    \brief      handle I2C1 event interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C2_EV_IRQHandler(void)
{
#ifdef USE_I2C2_AS_IPMB
    BaseType_t err;
    static BaseType_t xHigherPriorityTaskWoken;

    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_ADDSEND);
        g_i2c2_rx_count = 0; // start, clear recv count
        g_i2c2_buff_rx[g_i2c2_rx_count++] = GetDevAddr();
    }
    else if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C0);
        g_i2c2_buff_rx[g_i2c2_rx_count++] = i2c_data_receive(I2C2);
    }
    else if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_STPDET))
    {
        // status = SUCCESS;
        g_i2c2_recv_is_updated = true;
        /* clear the STPDET bit */
        i2c_enable(I2C2);
        err = xTaskNotifyFromISR((TaskHandle_t)ComTask_Handler,
                                 (uint32_t)MSG_SRC_I2C,
                                 (eNotifyAction)eSetValueWithoutOverwrite,
                                 (BaseType_t *)xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        if (err == pdFAIL)
        {
            printf("iic send failed!\r\n");
        }
    }
#else
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_ADDSEND))
    {
        /* clear the ADDSEND bit */
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_ADDSEND);
    }
    else if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_RBNE))
    {
        /* if reception data register is not empty ,I2C0 will read a data from I2C_DATA */
        //*i2c_rxbuffer++ = i2c_data_receive(I2C0);
    }
    else if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_STPDET))
    {
        /* clear the STPDET bit */
        i2c_enable(I2C2);
    }
#endif
}

/*!
    \brief      handle I2C1 error interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void I2C2_ER_IRQHandler(void)
{
    /* no acknowledge received */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_AERR))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_AERR);
    }

    /* SMBus alert */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_SMBALT))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_SMBALT);
    }

    /* bus timeout in SMBus mode */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_SMBTO))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_SMBTO);
    }

    /* over-run or under-run when SCL stretch is disabled */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_OUERR))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_OUERR);
    }

    /* arbitration lost */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_LOSTARB))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_LOSTARB);
    }

    /* bus error */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_BERR))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_BERR);
    }

    /* CRC value doesn't match */
    if (i2c_interrupt_flag_get(I2C2, I2C_INT_FLAG_PECERR))
    {
        i2c_interrupt_flag_clear(I2C2, I2C_INT_FLAG_PECERR);
    }

    /* disable the error interrupt */
    i2c_deinit(I2C2);
    i2c_channel_init(I2C2);
}

bool i2c2_get_slave_device_data(uint8_t *p_buffer, uint32_t *len)
{
    // if (!g_i2c2_recv_is_updated)
    // {
    //     return false;
    // }
    // memcpy(p_buffer, g_i2c2_buff_rx, g_i2c2_rx_count);
    // *len = g_i2c2_rx_count;
    // g_i2c2_recv_is_updated = false; // has read

    return false;
}
   
void i2c2_set_as_slave_device_addr(uint8_t device_addr)
{
    i2c_set_as_slave_device_addr(I2C2, device_addr);
}

/*!
    \brief      cofigure the NVIC peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void i2c2_nvic_config(void)
{
    nvic_irq_enable(I2C2_EV_IRQn, 3, 0);
    nvic_irq_enable(I2C2_ER_IRQn, 8, 0);
}
#endif
static void i2c_set_as_slave_device_addr(uint32_t i2c_periph, uint8_t device_addr)
{
    /* I2C address configure */
    i2c_mode_addr_config(i2c_periph, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, device_addr);
    /* enable I2C0 */
    i2c_enable(i2c_periph);
    /* enable acknowledge */
    i2c_ack_config(i2c_periph, I2C_ACK_ENABLE);
}


void i2c0_set_as_slave_device_addr(uint8_t device_addr)
{
    i2c_set_as_slave_device_addr(I2C0, device_addr);
}

void i2c1_set_as_slave_device_addr(uint8_t device_addr)
{
    i2c_set_as_slave_device_addr(I2C1, device_addr);
}
